<%@ Page Title="" Language="C#" MasterPageFile="~/Main.Master" AutoEventWireup="true" CodeBehind="ToSeeAngels.aspx.cs" Inherits="Islamic_Dreams.ToSeeAngels" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
	<title>خواب میں فر شتوں کا دیکھنا</title>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
	<div class="ref" style="margin-top: 56px;">
		<div class="container">
			<div class="ref-wrapper">
				<div class="ref-content text-center">
					<h2>
						<asp:Label runat="server" ID="lblSearch" Text="خواب میں فر شتوں کا دیکھنا" />
					</h2>
				</div>
			</div>
			<div class="p22para-wrapper">
				<p dir="rtl" class="text-justify">
					
					فر شتوں کے دیکھنے کی تاویل   بادشاہ کا با دین و دیانت  پر دلیل ہے  یا عا لم پرہیز گار پر دلیل ہے اور تما م فر شتوں میں سے چار فرشتے (1)جبرائیل ؑ(2)میکائیل ؑ (3)اسرافیلؑ (4)عزرائیل ؑ بزرگ ترین ہیں ۔
				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						سیدنا جبرائیلؑ :
					</strong>
					حضر ت ابن سیرین ؒ نے فر ما یا ہے کہ اگر  کوئی شخص حضر ت جبرائیل ؑ کو خوش طبع اور کشادہ دیکھے تو دلیل ہے کہ دشمن پر فتح پائے گا اور اپنی مراد کو پہنچے گا ۔اور اگر اس کے خلاف دیکھے تو اندوہ اور غم پر دلیل ہے ۔اگر خواب میں دیکھے کے اس کو جبرائیل ؑ نے خوشخبری دی ہے یا نیک و عدہ کیا ہے، یا کسی کا م سے روکا ہے تو عز ت اور دولت اور جمیعت خاطر کی دلیل ہے اوراگر اس کو کو ئی چیز دی ہے تو  بادشاہ سے مر تبہ ملے گا۔ بعض تعبیر بیا ن کرنے والے کہتے ہے کہ اگر خواب میں جبرائیل ؑ نے اس کو کچھ دیا ہے تو یہ خوف اور بڑی دہشت کی دلیل ہے ۔اگر لو گ اس کو خواب میں کہیں کہ تو جبرائیل ہے تو یہ دلیل ہے کہ سخن دان فصیح ہو گا اور مراد پائے گا اوربا امانت اور با دیا نت مشہو ر ہو گا ۔
				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						سیدنا میکائیل ؑ: 
					</strong>
					اگر کوئی شخص خواب میں میکائیل ؑ کو دیکھے،  جیسے کہ  ان کی صورت ہے تو یہ خیر اور بشارت کی دلیل ہے  کیو نکہ جبرائیل خواب کے لا نے والے اور میکائیل ؑ بشا رت اور نعمت وغیرہ کے لانے والے ہیں ۔حضرت ابن سیرین ؒ نے فر ما یا ہے کہ اگر خواب میں دیکھے کہ حضر ت میکائیل ؑ نے اس کو عطا دی ہے تو یہ خیر اور بزرگی کی دلیل ہے ۔اگر خواب میں دیکھے کہ لوگ اس کو میکائیل کہتے ہیں تو یہ دلیل ہے کہ اس سے لو گوں کی خیر اور بشا رت پہنچے گی اور نہایت قدرو منزلت پائے گا ۔
				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						سید نا اسر افیل ؑ: 
					</strong>
					حضرت ابن سیرین ؒ نے فر ما یا ہے کہ اگر کوئی شخص حضر ت اسرا فیل ؑکو ان  کی صور ت پر دیکھے تو یہ قوت اور بزرگی اور جاہ جلال اور علم و دانش کی دلیل ہے اورجس ملک میں دیکھے اس کی آبادی اور امن کی دلیل ہے۔ نر سنگا پھونکتے دیکھے تو بلا اور فتنے کی دلیل ہے۔ اگر دیکھے کہ  آپ کے ہاتھ میں نر سنگا ہے او ر پھونکتے ،نہیں ہیں دلیل ہے کہ شہر میں بلا ،فتنہ اورنہا یت   خوف پڑے گا ۔ اگر دیکھے کہ اسرافیل ؑ اس کے گھر میں آئے اور وہ سوتا ہو ا جاگ پڑا ہے دلیل ہےکہ اس  شہر کا بادشاہ اس پر خفا ہوگا ۔فر مان حق تعالیٰ ہے
				</p>
				
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
					وَنُفِخَ فِی الصُّورِ فَصَعِقَ مَنْ فِی السّمٰٰوٰتِ  وَمَنْ فِی الْاَرْضِ
					</span>
					
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						نر سنگا پھو نکا جا ئے گا اور جوشخص آسمانوں اور زمین میں ہے بچھڑ جائے گا  ۔
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						( الزمر 39/68)
					</span>
				</h3>
				<p dir="rtl" class="text-justify">
					
					حضرت کر مانی ؒ نے فر ما یا ہے کہ اگر اسرافیل ؑ کو کو ئی شخص خواب میں دیکھے کہ اندوہ گین صور پھونکتے ہیں اور اس نے بطور برکت صور کی آواز سنی ہے تو دلیل ہے کہ اس ملک میں مر گ پڑے گی اور ظالم لوگ ہلا ک ہونگے۔ اگر دیکھے کہ اسرافیل ؑ تازہ روئی اور خوشی کے ساتھ اس کی طرف دیکھتے ہیں تو اس امر کی دلیل ہے کہ اس کو بادشاہ سے امن اور خیر پہنچے گی ۔ اگر دیکھے کہ اسرافیل ؑ نے چٹھی پر مہر لگا کر اس کو دی ہے تو دلیل ہے کہ اس کی موت قریب ہے ۔ اگر دیکھے کہ اسرافیل ؑ نے اس پر آوازہ کسا اور غائب ہو گئے تو یہ دلیل ہے کہ اس کو بادشاہ کی طرف سے نقصان پہنچے گا ۔

				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						سید نا عزرائیل ؑ :
					</strong>
					حضرت ابن سیرین ؒ نے فر ما یا ہے کہ اگر کوئی ملک الموت کو آسمان پر اور اپنے آپ کو زمین پر دیکھے تو دلیل ہے کہ وہ شخص اپنے کا م سے معزول ہو گا ۔ اگر اپنے پاس دیکھے تو دلیل ہےکہ اس کی موت قریب ہے ۔ اگر ملک المو ت کو خوش دیکھے تو شہا د ت کی دلیل ہے ۔ اگر ملک المو ت سے کشتی کی اور گر پڑا تو دلیل ہے کہ دنیا سے جلدی رخصت ہو گا ۔ اگر ملک الموت کو گرا لیا  تو بعض تعبیر دان بیان کرتے ہیں کہ بیمار ہو گا لیکن شفاء پائے گا ۔
				
				</p>
				<p dir="rtl" class="text-justify">
					حضر ت جابر مغربی ؒ نے فر ما یا ہے کہ جو کوئی ملک الموت کو خواب میں خرم و شاداں دیکھے تو دلیل ہے کہ اس کی زندگی دراز ہو گی ۔ اگر سلا م کر تا ہوا دیکھے تو یہ شخص جلدی شہادت پائے گا ۔ اگر شیرینی دیتا دیکھے تو جا ن آسانی سے نکلے گی ۔ اگر غصے میں دیکھے تو اس کی موت خطر ناک ہو گی ۔ اگر کوئی تلخ چیز دیتا ہو ا دیکھے تو اس کی جان مشکل سے نکلے گی ۔ اگر خواب میں لوگ اس کو خبر دیں کہ ملک الموت فلاں جگہ ہے اور وہ دور سے دیکھے تو دلیل ہے کہ اس کو بادشاہ سے کام پڑے گا ۔ اگر خواب میں دیکھے کہ اس نے ملک و الموت کو مار ڈالا تو دلیل ہے کہ یہ شخص دشمن خلق ہوگا ۔
				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						حاملانِ عرش فرشتوں کا دیکھنا:
					</strong>
					ا ملان عرش وہ فرشتے ہیں کہ جنہوں نے اللہ تعا لیٰ کے امر سے عرش الٰہی کو اٹھایا ہو ا ہے ۔اگر کوئی ان کو خواب میں دیکھے تو مراد پائے اور بادشاہ بنے ۔اگر ان سے ملاقات کی ہے تو کسی بزرگ بادشاہ سے کام پڑے گا اور خیر و منعفت دیکھے گا ۔حضرت ابراہیم کرمانی ؒ نے فر ما یا ہے کہ خواب میں حاملا ن عرش کو دیکھنے والا دین داروں سے ملے گا اور حج کرے گا  ۔فر مان حق تعالیٰ ہے :
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						وَتَرَی الْمَلٰئِکَتَہ  حَا ۤفِّیْنَ مِنْ حَوْلِ  الْعَرْ شِ یُسَبِّحُوْنَ بِحَمْدِ رَبِّھِمْ
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						اور تو فر شتوں کو عرش کے گرد  صف باندھے دیکھے گا کہ وہ اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda;font-size: 16px">
						( الزمر 39/75)
						</span>
				</h3>
				<p dir="rtl" class="text-justify">
					اگر فر شتے اس پر مہربانی کریں اور عبا دت میں اپنے ساتھ شر یک کریں تو یہ اس بات کی دلیل ہے کہ اس کی موت قریب آگئی ہے ۔
				</p>
				<p dir="rtl" class="text-justify">
					<strong style="font-size: larger; color: #dcac6e;padding-left: 10px">
						کرا ماً کا تبین کا دیکھنا:
					</strong>
					کرماً  کاتبین  وہ فر شتے ہیں کہ سب لوگوں کے کر دار اور گفتار ، نیک اور بد کو لکھتے ہیں ۔ حضرت ابن سیرین ؒ نے فر مایا ہے کہ اگر کوئی شخص ان کو خواب میں دیکھے ۔اگر نیک ہے تو دو نو ں جہا ں میں خیر اور صلاح پائے گا  ۔ اگر مفلس ہے تو غم اور اندوہ اٹھا ئے گا ۔ فر ما ن حق تعالیٰ ہے :
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						اَعْلَم ُ بِمَا  یَفْعَلُوْنَ
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						سب کے کاموں کو خوب جانتاہے ۔ 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						(الزمر 39/70)
					</span>
				</h3>
				<p dir="rtl" class="text-justify">
					اگر ان فر شتوں کو آپس میں لڑتے دیکھے تو دلیل ہے کہ یہ شخص گنہگا ر اور نا فر مان ہے اور عذ اب خدا کا مستحق ہے ۔فر ما ن باری تعالیٰ ہے :
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						اِنّا  نُبَشّرُ کَ بِغُلٰمِ نِ اسْمُہٗ  یَحْیٰی
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						ہم تجھے ایک لڑکے کی بشا ر ت دیتے ہیں جس کا نام یحیی ٰہے ۔ 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						( مریم 19/7)
					</span>
				</h3>
				<p dir="rtl" class="text-justify">
					اگر فر شتوں کو دیکھے کہ کسی چیز کے لینے کے منتظر ہیں تو دلیل ہے کہ اس کے مال اور نعمت میں  زوال آئے گا  ۔ا گر فر شتوں کو کسی جگہ   کھڑا دیکھے تو وہا  ں  امن ہو گا اورا گر لڑائی میں دیکھے تو دشمن پر کامیاب ہو گا ۔اگر رکوع و سجود میں دیکھے تو یہ دلیل ہے کہ اس کی دنیا اور دین کے احکام احوال مستقیم پر ہیں ۔ اگر فر شتوں کو عورتوں کی شکل میں دیکھے تو یہ دلیل ہے کہ خواب دیکھنے والا اللہ تعالیٰ پر جھوٹ لگا تا ہے ۔ 
				</p>
				<p dir="rtl" class="text-justify">
					فر مان حق تعالیٰ ہے 
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						اَفَاَ صْفٰکُمْ رَبُّکُمْ بِا لْبَنِیْنَ وَ اتَّخَذَ مِنَ الْمَلٰۤئِکَتِہ  اِنَا ثًا اِنَّکُمْ  لَتَقُوْ لُوْ نَ قَوْ لاً عَظِیْمًا  
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						کیا اللہ تعالیٰ نے تمہیں بیٹے دیئے اور خود بیٹیاں لیں ، تم ایک بہت بڑی بات کہتے ہو ۔ ( 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						( بنی اسرائیل 17/40)
					</span>
				</h3>
				<p dir="rtl" class="text-justify">
					اگر خواب میں دیکھے کہ پر ر کھتا ہے اور فر شتو ں کے ساتھ اڑتا ہے تو اس کی موت قریب ہے اور دنیا سے توبہ کر کے مر ے گا ۔ اگر دور سے فر شتوں کو دیکھے اور ان کے قریب نہیں جا سکتا ہے تو اس پر مصیبت پڑنے کی دلیل ہے ۔فر مان حق تعالی ہے :
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						یَرَوْ نَ الْمَلٰۤئِکَتَہ لَا بُشْرٰ ی یَو مَئِذٍ لِّلْمُجْرِ مِیْنَ
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						فر شتوں کو دیکھیں گے ، اس دن گنہگاروں کے لئے خوشی نہیں ہے۔ 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						( الفر قان 25/22)
					</span>
				</h3>
				
				<p dir="rtl" class="text-justify">
					اوراگر دیکھے کہ فر شتے اس کو اپنی اطاعت کا امر فر ما تے ہیں اگر نیک ہے کہ شاد ی اور خوشی دیکھے گااور اگر برا ہے تو رنج و غم دیکھے گا ۔ فر مان حق تعالیٰ ہے :
				</p>
				<h3 style="font-family: _PDMS_Saleem_QuranFont; color: #dcac6e; text-align: center">
					<span style="font-size: 40px">
						اِ قْر َاْ کِتٰبَکَ کَفٰی بِنَفْسِکَ الْیَوْ مَ عَلَیْکَ حَسِیْباً
					</span>
					<br>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda">
						اپنی کتاب پڑ ھ ۔آج کے دن تیرا نفس ہی تجھ پر حساب لینے کے لئے کافی ہے ۔ 
					</span>
					<span style="color: #b59060; text-align: right; font-family: JameelNooriNastaleeqKasheeda; font-size: 16px;">
						( بنی اسرائیل 17/14)
					</span>
				</h3>

				<p dir="rtl" class="text-justify">
					اگر خواب میں دیکھے کہ فر شتے اس کو عزت کے ساتھ سلام کرتے ہیں تو دلیل ہے کہ دشمن پر فتح پائے گا اور انجام بخیر ہو گا ۔اگر ان کو ایک جگہ پر اترے ہوئے دیکھے تو دلیل ہے کہ وہا  ں کے لوگ غم  اور اندوہ سے نجات پائیں گے کیونکہ فرشتے ہمیشہ پیغمبروں کی مد د کے لیے آتے ہیں۔ 
				</p>
				
				<p dir="rtl" class="text-justify">
					حضرت کرمانی ؒفرماتے ہیں صاحب خواب  کا فرشتوں کو دیکھنا پند اور نصیحت ہے اور اگر فرشتے کو وصیت کرتے دیکھے تو یہ شخص شہید ہو گا ۔ اگر مقرب  فرشتوں کو کسی جگہ میں دیکھے کہ اس جگہ اہل اسلام کافروں کے ساتھ جنگ کر تے ہیں تو اہل اسلام کی فتح ہو گی اور اگر اس جگہ رنج ، قحط او ر سختی ہوگی تو اللہ تعالیٰ اس جگہ والوں کو اس سے نجات دے گا ۔ اگر دیکھے کہ فر شتہ بن کر آسما ن کو چلا گیا ہے تو دلیل ہے کہ یہ شخص دنیا میں زہد اختیا  ر کرے گا اور دنیا سے دستبردار ہو کر راہ آخرت تلاش کرے گا ۔ا گر دیکھے کہ فر شتوں کے ساتھ آسمان پر چلا گیا ہے اور واپس نہیں آیا ہے تو جلد ی دنیا سے سفر کرے گا اور اپنا نیک نام چھوڑے گا ۔
				</p>
				
				<p dir="rtl" class="text-justify">
					حضرت جابر مغربی ؒ نے فر مایا ہے کہ اگر خواب میں دیکھے کہ مقرب فرشتہ عز ت کے ساتھ اس کی طرف دیکھتا ہے تو وہ شخص بیماری سے جلد شفاء پائے گا اوراس کے بعد حج اور جہاد کرے گا اور بہت سے نیک کام کرے گا ۔ اگر اپنے آپ کو فر شتے کی صورت پر دیکھے تو دلیل ہے کہ غم اور قرض سے نجات پائے گا ۔ اگر مال دار ہے تو مال زیا دہ ہو گااور اگر درویش ہےتو غنی ہو گا ۔
				</p>
				
				<p dir="rtl" class="text-justify">
					حضرت جعفر صادق ؒ نے فر مایا ہے کہ اگر خواب میں دیکھے کہ فر شتے اس کو کسی کام کی بشارت دیتے ہیں تو یہ دلیل ہے  کہ کو ئی بزرگ آدمی اس کو کسی کام پر لگا ئے گا ۔ اگر دیکھے کہ فر شتہ اس کو عطا دیتا ہے تو وہ شخص عطا اور بزرگی پائے گا ۔ اگر فر شتہ کو استقبال کر تا دیکھے گا تو دونوں جہاں کی دولت پائے گا ۔ اگر دیکھے کہ فر شتے اس کی زیارت کو آئے ہیں اور شمع اور چراغ ان کےپاس ہیں تو دلیل ہے کہ اس کے یہاں دانا اور عالم فر زند آئے گا ۔ اگر دیکھے  کہ فر شتے ا س کو سفید یا سبز کپڑے دیتےہیں تو دلیل ہے کہ وہ خود مر ے گا اور اس کے عزیز وں میں سے کوئی مرے گا ۔ اگر دیکھے کہ اس کی طرف خوشی سے دیکھتے ہیں تو اس کا انجام بخیر ہوگا ۔ اگر خواب میں فر شتہ جامع قر آن دے یا خط لکھا ہو ا دے تو دلیل ہے کو کوئی شخص اس پر حکومت کرے گا  اور اس پر غالب آئے گا ۔
				</p>

			</div>
		</div>
	</div>
</asp:Content>
<asp:Content ID="Content3" ContentPlaceHolderID="ContentPlaceHolderFooter" runat="server">
	
</asp:Content>
